#!/usr/bin/env python3
#-*- coding:utf-8 -*-
# datetime:2019/12/7 11:24
# email: wagyu2016@163.com
# author: 雨泽
# copyright: 湖南省零檬信息技术有限公司

def func_1():
    pass

def func_2():
    pass

# 模块导入
# 什么是模块  module ？？ 就是一个 python 文件。一个模块里面会有很多的函数，类
# 包，package, 就是一个 python 文件的 文件夹。。会有 一个多多个模块
# 包含一个 __init__.py 模块的文件夹
# 标准库，第三方库：实现特定功能的代码集合。 一个模块，也可以是一个包，
# 模块导入的作用

# import 的关键字
#


# 总计：
"""
1, 函数的相互调用， （python 代码内部执行的机制， 为什么要定格， :）
2, 局部变量和全局变量
3，获取：局部能在全局获取吗？？   全局能在局部获取吗？
4，修改：如果想在局部修改全局，global
5, 内置，记忆常用的， id(), 
6，什么是模块和包。
7, 查看源码的方法非常重要：1， 看函数名称，2， 注解， 3， 返回值。4， 参数。
# 可以百度 bd 的坑壁。
# 如果有一些错误类型， bd
# 原理，基础知识：尽量不要 bd, cn.
"""

# 导包
# 文件
# qtranslate