#!/usr/bin/env python3
#-*- coding:utf-8 -*-
# datetime:2019/12/14 10:39
# email: wagyu2016@163.com
# author: 雨泽
# copyright: 湖南省零檬信息技术有限公司
print("hello")

"""
1, 什么是类.
具有相同的特征的某一些事务的种类，集合。


小马哥是属于什么类，什么种类？？  人类， 大佬， 单身类， Man 类
吉祥  是属于什么类， 什么种类？？  人类， 大佬， 女装大佬类，  Girl 类
雨泽 是属于什么类， 什么种类？？   禽兽类， 菜鸟类，  女装大佬类， 

1， 同样的一个人或物，可以属于多个类吗？？？ 可以属于多个类
2， 不同的人和物，可以属于同一个类吗？？？ 可以

类的定义
class 类名():
    类的内容
    类体
    
类名表示：
- 类名也是标识符
- 字母，数字，下划线，且不能以数字开头
- 不能是关键字
- 大驼峰式命名： BigBoss,   小驼峰（别的语言当中）：bigBoss
- APILanglang ApiLangLang



表示方法：

2， 什么是对象
对象就是类当中的一个成员。 TODO: 如果表示某一个成员：吉祥

"""

# 类定义
class BigBoss:
    pass

# 类的使用， 类的实例化，对象化，类的初始化
# 可以使用整个
# 使用整个类
print(BigBoss)
# 使用类当中的一个成员，TODO: 对象，实例, 东西， object
print(BigBoss())


